app/Controllers/admin/Dashboard.php

SELECT SUM(customers.amount) as totalAmount
FROM `Bookings`
JOIN `customers` ON `customers`.`customerId` = `bookings`.`customerId`
JOIN `classes` ON `bookings`.`classId` = `classes`.`classId`
WHERE DATE_FORMAT(classes.date, '%Y-%m') = '2024-02'
AND `Bookings`.`deleted_at` IS NULL
 LIMIT 1
SELECT SUM(jumlah_orang) as totalPeople
FROM `Bookings`
WHERE DATE_FORMAT(booking_date, '%Y-%m') = '2024-02'
AND `status_booking` = 'accept'
AND `Bookings`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(*) as totalClasses
FROM `Classes`
WHERE DATE_FORMAT(date, '%Y-%m') = '2024-02'
 LIMIT 1
---
    public function index()
    {
        $data['active_page'] = 'dashboard';
        $data['username'] = $this->username;
        $data['role'] = $this->role;

        $customerModel = new CustomerModel();
        $classModel = new ClassModel();
        $bookingModel = new BookingModel();

        $currentYear = date("Y");
        $currentMonth = date("m");

        if ($this->role == 'admin') {
            $data['nominal'] = $bookingModel
                                ->select('SUM(customers.amount) as totalAmount')
                                ->join('customers', 'customers.customerId = bookings.customerId')
                                ->join('classes', 'bookings.classId = classes.classId')
                                ->where("DATE_FORMAT(classes.date, '%Y-%m') = ", $currentYear . '-' . $currentMonth)
                                ->first();

            $data['user'] = $bookingModel
                    ->select('SUM(jumlah_orang) as totalPeople')
                    ->where("DATE_FORMAT(booking_date, '%Y-%m') = ", $currentYear . '-' . $currentMonth)
                    ->where('status_booking', 'accept')
                    ->first();

            $data['jumlahClass'] = $classModel
                    ->select('COUNT(*) as totalClasses')
                    ->where("DATE_FORMAT(date, '%Y-%m') = ", $currentYear . '-' . $currentMonth)
                    ->first();

SELECT *
FROM `identity`
---
    public function identity()
    {
        $data['active_page'] = 'identity';
        $data['username'] = $this->username;
        $data['role'] = $this->role;

        $identity = new IdentityModel();

        $data['identity'] = $identity->findAll();

SELECT MAX(`code`) AS `code`
FROM `Classes`
WHERE `code` LIKE 'D2024%' ESCAPE '!'
SELECT `classes`.*, `users`.`name` as `pemilik`
FROM `Classes`
LEFT JOIN `users` ON `classes`.`userId` = `users`.`userId`
ORDER BY CASE WHEN status = 'open' THEN 1 ELSE 2 END, `classId` DESC
---
    public function class()
    {
        $classModel = new ClassModel();

        // Generate new code
        $year = date("Y");  // Tahun ini

        $query = $classModel->selectMax('code')
                            ->like('code', "D{$year}", 'after')  // Memfilter berdasarkan tahun ini
                            ->get();

        $lastCode = $query->getRowArray();
        $lastCode = $lastCode['code'];

        if ($lastCode) {
            $number = (int) substr($lastCode, -4);  // Mengambil 4 digit terakhir dari kode
            $number++;
        } else {
            $number = 1; // Jika tidak ada data, mulai dari 0001
        }

        $newCode = "D{$year}" . str_pad($number, 4, '0', STR_PAD_LEFT);  // Membuat kode baru

        if ($this->role == 'admin') {
            $data['class'] = $classModel->select('classes.*, users.name as pemilik')
                                        ->orderBy("CASE WHEN status = 'open' THEN 1 ELSE 2 END, classId DESC")
                                        ->join('users', 'classes.userId = users.userId', 'left')
                                        ->findAll();

SELECT `bookings`.*, `customers`.*, `classes`.*, `users`.`name` as `pemilik`, `users`.`userId`
FROM `Bookings`
JOIN `customers` ON `customers`.`customerId` = `bookings`.`customerId`
JOIN `classes` ON `classes`.`classId` = `bookings`.`classId`
LEFT JOIN `users` ON `classes`.`userId` = `users`.`userId`
WHERE `bookings`.`deleted_at` IS NULL
AND `Bookings`.`deleted_at` IS NULL
ORDER BY CAST(customers.amount AS UNSIGNED) ASC
SELECT *
FROM `Bookings`
JOIN `classes` ON `classes`.`classId` = `bookings`.`classId`
WHERE `Bookings`.`deleted_at` IS NULL
GROUP BY `classes`.`code`
---
    public function booking()
    {
        $bookingModel = new BookingModel();

        $bookingModel->orderBy('CAST(customers.amount AS UNSIGNED)', 'ASC');
        $bookingModel->join('customers', 'customers.customerId = bookings.customerId');
        $bookingModel->join('classes', 'classes.classId = bookings.classId');
        $bookingModel->where('bookings.deleted_at', null);

        if ($this->role == 'admin') {
            $data['bookings'] = $bookingModel
                ->select('bookings.*, customers.*, classes.*, users.name as pemilik, users.userId')
                ->join('users', 'classes.userId = users.userId', 'left')
                ->findAll();
        } else {
            $data['bookings'] = $bookingModel
                ->select('bookings.*, customers.*, classes.*, users.name as pemilik, users.userId')
                ->join('users', 'classes.userId = users.userId', 'left')
                ->where('classes.userId', $this->userId)->findAll();
        }

        $uniqueCodeModel = new BookingModel();

        $uniqueCodes = $uniqueCodeModel->join('classes', 'classes.classId = bookings.classId')
                               ->groupBy('classes.code')
                               ->findAll();

SELECT *
FROM `bank_account`
WHERE `userId` = '2'
---
    public function bank()
    {
        $bankModel = new BankAccountModel();

        $data['bank'] = $bankModel->where('userId', $this->userId)->findAll();