app/Controllers/Landingpage.php

    public function index()
    {
        // Mengecek apakah parameter 'id' ada di query string
        $request = \Config\Services::request();
        $id = $request->getGet('id');

        if ($id === null) {
            // Redirect jika 'id' tidak ditemukan
            return redirect()->to('/auth');
        }

        $classModel = new ClassModel();

        $classData = $classModel->where('code', $id)->first();

        if (empty($classData)) {
            return redirect()->to('/auth');
        }

        // Jika 'id' ada, lanjutkan dengan logika yang ada
        $data['code'] = $id;
        $data['identities'] = $this->identityModel->findAll();
---
SELECT *
FROM `Classes`
WHERE `code` = 'D20240001'
 LIMIT 1
SELECT *
FROM `identity`