app/Models/IdentityModel.php

    public function getEmailConfig($code)
    {
        return $this->where('code', $code)->first();
---
SELECT *
FROM `identity`
WHERE `code` = 'title_page'
 LIMIT 1